back/app/controllers/pessoa_fisicas_controller.rb

SELECT "pessoa_fisicas".* FROM "pessoa_fisicas"
---
  def index
    @pessoa_fisicas = PessoaFisica.all

INSERT INTO "pessoa_fisicas" ("cpf", "pessoa_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cpf", "47656284850"], ["pessoa_id", 1], ["created_at", "2019-08-19 16:31:44.765963"], ["updated_at", "2019-08-19 16:31:44.765963"]]
---
  def create
    @pessoa_fisica = PessoaFisica.new(pessoa_fisica_params)

    if @pessoa_fisica.save

UPDATE "pessoa_fisicas" SET "cpf" = $1, "pessoa_id" = $2, "updated_at" = $3 WHERE "pessoa_fisicas"."id" = $4  [["cpf", "47656284853"], ["pessoa_id", 3], ["updated_at", "2019-08-19 16:33:35.433047"], ["id", 1]]
---
  def update
    if @pessoa_fisica.update(pessoa_fisica_params)

DELETE FROM "pessoa_fisicas" WHERE "pessoa_fisicas"."id" = $1  [["id", 1]]
---
  def destroy
    @pessoa_fisica.destroy

SELECT  "pessoa_fisicas".* FROM "pessoa_fisicas" WHERE "pessoa_fisicas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_pessoa_fisica
      @pessoa_fisica = PessoaFisica.find(params[:id])