back/app/controllers/pessoas_controller.rb

  def index
    @pessoas = Pessoa.all
---
SELECT "pessoas".* FROM "pessoas"

  def create
    @pessoa = Pessoa.new(pessoa_params)

    if @pessoa.save
---
INSERT INTO "pessoas" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Adrielly"], ["created_at", "2019-08-19 16:27:17.449748"], ["updated_at", "2019-08-19 16:27:17.449748"]]

  def update
    if @pessoa.update(pessoa_params)
---
UPDATE "pessoas" SET "nome" = $1, "updated_at" = $2 WHERE "pessoas"."id" = $3  [["nome", "Pirico lindo"], ["updated_at", "2019-08-19 16:30:27.007405"], ["id", 1]]

  def destroy
    @pessoa.destroy
---
DELETE FROM "pessoas" WHERE "pessoas"."id" = $1  [["id", 2]]

    def set_pessoa
      @pessoa = Pessoa.find(params[:id])
---
SELECT  "pessoas".* FROM "pessoas" WHERE "pessoas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]