back/app/controllers/pessoa_juridicas_controller.rb

SELECT "pessoa_juridicas".* FROM "pessoa_juridicas"
---
  def index
    @pessoa_juridicas = PessoaJuridica.all

INSERT INTO "pessoa_juridicas" ("cnpj", "pessoa_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["cnpj", "47656284850"], ["pessoa_id", 3], ["created_at", "2019-08-20 21:43:18.630816"], ["updated_at", "2019-08-20 21:43:18.630816"]]
---
  def create
    @pessoa_juridica = PessoaJuridica.new(pessoa_juridica_params)

    if @pessoa_juridica.save

UPDATE "pessoa_juridicas" SET "cnpj" = $1, "pessoa_id" = $2, "updated_at" = $3 WHERE "pessoa_juridicas"."id" = $4  [["cnpj", "47656275153"], ["pessoa_id", 1], ["updated_at", "2019-08-20 22:08:02.422954"], ["id", 1]]
---
  def update
    if @pessoa_juridica.update(pessoa_juridica_params)

DELETE FROM "pessoa_juridicas" WHERE "pessoa_juridicas"."id" = $1  [["id", 2]]
---
  def destroy
    @pessoa_juridica.destroy

SELECT  "pessoa_juridicas".* FROM "pessoa_juridicas" WHERE "pessoa_juridicas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_pessoa_juridica
      @pessoa_juridica = PessoaJuridica.find(params[:id])