back/app/controllers/planos_controller.rb

  def index
    @planos = Plano.all
---
SELECT "planos".* FROM "planos"