back/app/controllers/tipo_cultivos_controller.rb

SELECT "tipo_cultivos".* FROM "tipo_cultivos"
---
  def index
    @tipo_cultivos = TipoCultivo.all

INSERT INTO "tipo_cultivos" ("nome", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["nome", "Hortaliça"], ["created_at", "2019-08-16 10:18:23.816325"], ["updated_at", "2019-08-16 10:18:23.816325"]]
---
  def create
    @tipo_cultivo = TipoCultivo.new(tipo_cultivo_params)

    if @tipo_cultivo.save

UPDATE "tipo_cultivos" SET "nome" = $1, "updated_at" = $2 WHERE "tipo_cultivos"."id" = $3  [["nome", "Fruta"], ["updated_at", "2019-08-16 10:20:24.575540"], ["id", 1]]
---
  def update
    if @tipo_cultivo.update(tipo_cultivo_params)

DELETE FROM "tipo_cultivos" WHERE "tipo_cultivos"."id" = $1  [["id", 2]]
---
  def destroy
    @tipo_cultivo.destroy

SELECT  "tipo_cultivos".* FROM "tipo_cultivos" WHERE "tipo_cultivos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_tipo_cultivo
      @tipo_cultivo = TipoCultivo.find(params[:id])